In [4]:
import pandas
from pandas import *

In [27]:
df = pandas.read_csv("pandas.csv")
df

   No      Name  Age  Class Section  Phone number location
0  11  Abdullah   20     12  Ghouri     300300003   multan
1   2       ali   12     12  Ghouri     300300003   multan
2   3      omer   13     12  Ghouri     300300003   multan

In [29]:
df["No"][0] = 1
df

C:\Users\ABDULL~1\AppData\Local\Temp/ipykernel_6836/3883173080.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["No"][0] = 1

   No      Name  Age  Class Section  Phone number location
0   1  Abdullah   20     12  Ghouri     300300003   multan
1   2       ali   12     12  Ghouri     300300003   multan
2   3      omer   13     12  Ghouri     300300003   multan

In [30]:
df.loc[0,"Name":"location"]

Name             Abdullah
Age                    20
Class                  12
Section            Ghouri
Phone number    300300003
location           multan
Name: 0, dtype: object

In [31]:
df.loc[1,"Name":"location"]

Name                  ali
Age                    12
Class                  12
Section            Ghouri
Phone number    300300003
location           multan
Name: 1, dtype: object

In [32]:
df.loc[2,"Name":"location"]

Name                 omer
Age                    13
Class                  12
Section            Ghouri
Phone number    300300003
location           multan
Name: 2, dtype: object

In [34]:
df

   No      Name  Age  Class Section  Phone number location
0   1  Abdullah   20     12  Ghouri     300300003   multan
1   2       ali   12     12  Ghouri     300300003   multan
2   3      omer   13     12  Ghouri     300300003   multan

In [38]:
df.drop("No",1)

C:\Users\ABDULL~1\AppData\Local\Temp/ipykernel_6836/328685644.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df.drop("No",1)

       Name  Age  Class Section  Phone number location
0  Abdullah   20     12  Ghouri     300300003   multan
1       ali   12     12  Ghouri     300300003   multan
2      omer   13     12  Ghouri     300300003   multan

In [52]:
df

   No      Name  Age  Class Section  Phone number location
0   1  Abdullah   20     12  Ghouri     300300003   multan
1   2       ali   12     12  Ghouri     300300003   multan
2   3      omer   13     12  Ghouri     300300003   multan

Let suppose i want to drop the some index at a time and some colums

In [57]:
df.drop(df.index[1:2])

   No      Name  Age  Class Section  Phone number location
0   1  Abdullah   20     12  Ghouri     300300003   multan
2   3      omer   13     12  Ghouri     300300003   multan

In [58]:
# same process here in the colums

In [63]:
df.drop(df.columns[2])

KeyError: "['Age'] not found in axis"